Revit 2024 API
HemisphericalLightDistribution Properties
The HemisphericalLightDistribution type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightDistribution.)
See Also
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace